{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### TODO\n",
    "        self.grouped_info = {} #need to be grouped format with {'labels':[properties]...}\n",
    "        #TODO: generalize this to enable random pick of any value of any property; which means\n",
    "        #need to generalize the grouped_info dict maybe to a mega dict or mega list\n",
    "\n",
    "- add_specific_node_prop function that would by chance add a specific property as part of the condition to match for a node when calling add_node()\n",
    "-     def add_node(self):\n",
    "        node_label, properties_list = random.choice(list(self.grouped_names.items()))\n",
    "        #TODO: have intelligent alias that can avoid overlapping node labels\n",
    "- node_value = f\"{property_labels} {{{properties_str}}}\" 需要重新整合input dataset so that不仅node可对应property，property label也可对应property\n",
    "-     def add_hop(self,hop_p=0.5):\n",
    "        \"\"\"\n",
    "        Randomly generate hops as condition to relationship based on a customizable possibility;\n",
    "        the default possibility is 0.5\n",
    "        \"\"\"\n",
    "        hop = random.randint(0,10) #TODO: see if this is reasonable"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cook labels and properties\n",
    "- Grep csv file containing node labels, relationships, property labels, and wanted properties from Memgraph\n",
    "- Create a nested dictionary with {node_labels:{sub_dictionary of properties}}, the sub_dictionary contains corresponding {property_labels: properties}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "import re\n",
    "import random\n",
    "import json\n",
    "import pandas as pd\n",
    "\n",
    "# Open and load the graph schema json file\n",
    "with open('/Users/yufeimeng/Desktop/KGCypherGenerator/schema.json', 'r',encoding='utf-8-sig') as file:\n",
    "    schema = json.load(file)\n",
    "    \n",
    "# Extract nodes and edges from the schema\n",
    "#labels = [node['labels'][0] for node in schema[0]['nodes']]\n",
    "relationships = [relationship['type'] for relationship in schema[0]['relationships']]\n",
    "\n",
    "\n",
    "# Get detailed properties from the csv file\n",
    "common_names = pd.read_csv('/Users/yufeimeng/Desktop/KGCypherGenerator/memgraph-query-results-export.csv', index_col=False)\n",
    "\n",
    "def group_labels(df, label_col, name_col):\n",
    "    grouped = df.groupby(label_col)[name_col].apply(list).to_dict()\n",
    "    return grouped\n",
    "\n",
    "# Applying the function\n",
    "grouped_names = group_labels(common_names, 'label', 'commonName')\n",
    "\n",
    "#***************************************\n",
    "labels = list(grouped_names.keys())\n",
    "property_labels= [\"commonName\"] #will be generalized later"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create alzkb nested dictionary\n",
    "- In the current test case, all node labels are used; only commonName properties are selected for all nodes except that geneSymbol for Gene node is also added."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "# type(grouped_names)\n",
    "# grouped_names.keys()\n",
    "# list(grouped_names.values())[0]\n",
    "\n",
    "geneSymbol_csv = pd.read_csv('geneSymbol.csv', index_col=False)\n",
    "# type(geneSymbol_csv)\n",
    "# type(geneSymbol_csv['g.geneSymbol'])\n",
    "\n",
    "geneSymbol = list(geneSymbol_csv['g.geneSymbol'])\n",
    "# geneSymbol\n",
    "\n",
    "geneSymbol_sub_dict = {}\n",
    "geneSymbol_sub_dict['geneSymbol'] = geneSymbol\n",
    "\n",
    "\n",
    "alzkb_nested_dict = {}\n",
    "for key in grouped_names.keys():\n",
    "    sub_dict = {}\n",
    "    if key == 'Gene':\n",
    "        sub_dict['commonName']= grouped_names[key]\n",
    "        sub_dict['geneSymbol']= geneSymbol\n",
    "    else:\n",
    "        sub_dict['commonName']= grouped_names[key]\n",
    "    alzkb_nested_dict[key] = sub_dict\n",
    "\n",
    "# alzkb_nested_dict['Gene'].keys()\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### DepthManager, Clause, Node classes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "class DepthManager:\n",
    "    _max_depth = 5  # Default maximum depth\n",
    "    _min_depth = 3\n",
    "\n",
    "    def __init__(self):\n",
    "        self.depth = 0  # Starting depth\n",
    "\n",
    "    @classmethod\n",
    "    def set_max_depth(cls, depth):\n",
    "        if depth > cls._min_depth:\n",
    "            cls._max_depth = depth\n",
    "        else:\n",
    "            print(\"Maximum depth cannot be smaller than the min depth! \\n The default max_depth is\", cls._max_depth)\n",
    "    \n",
    "    def depth_control(self, func):\n",
    "        def wrapper(*args, **kwargs):\n",
    "            if self.depth == self._max_depth:\n",
    "                print(\"Max depth reached\")\n",
    "                return None\n",
    "            result = func(*args, **kwargs)\n",
    "            self.depth += 1  # Increment depth after function call\n",
    "            return result\n",
    "        return wrapper\n",
    "    \n",
    "    def reset_depth(self):\n",
    "        self.depth = 0\n",
    " \n",
    "class Clause():\n",
    "    def __init__(self, value, children=None):\n",
    "        self.value = value\n",
    "        self.children = children if children is not None else []\n",
    "\n",
    "    def __str__(self):\n",
    "        if not self.children:\n",
    "            return str(self.value)\n",
    "        if self.value == \"RETURN\":\n",
    "            return f\"{self.value} {', '.join(str(child) for child in self.children)}\"\n",
    "        return f\"{self.value} {' '.join(str(child) for child in self.children)}\"\n",
    "    \n",
    "class Node:\n",
    "    \"\"\"\n",
    "    When called, will add connector to either nodes or relationships \n",
    "    \"\"\"\n",
    "    def __init__(self, value, children=None):\n",
    "        self.value = value\n",
    "        self.children = children if children is not None else []\n",
    "\n",
    "    def __str__(self):\n",
    "        if not self.children:\n",
    "            return str(self.value)\n",
    "        if self.value == '-':  \n",
    "            return ' '.join(str(child) for child in self.children)\n",
    "        return f\"{self.value}({', '.join(str(child) for child in self.children)})\"\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query Manager Class "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "depth_manager = DepthManager()   \n",
    "\n",
    "class QueryManager:\n",
    "    def __init__(self):\n",
    "        \n",
    "        self.nodes = []\n",
    "        self.node_labels = []\n",
    "        self.relationships = []\n",
    "        \n",
    "        # self.property_labels = []\n",
    "        self.grouped_info = {} #need to be grouped format with {'labels':[properties]...}\n",
    "        #TODO: generalize this to enable random pick of any value of any property; which means\n",
    "        #need to generalize the grouped_info dict maybe to a mega dict or mega list\n",
    "\n",
    "        self.usable_labels = set()\n",
    "\n",
    "        self.selected_label_alias = {}\n",
    "\n",
    "        self.parts = [] \n",
    "    \n",
    "    def __str__(self):\n",
    "        return \"\\n\".join(str(node) for node in self.nodes)\n",
    "    \n",
    "    def import_grouped_info(self, input_group):\n",
    "        if input_group:\n",
    "            if type(input_group) is dict:\n",
    "                self.grouped_info = input_group\n",
    "                self.node_labels = list(self.grouped_info.keys())\n",
    "                print(\"loaded node_labels:\",self.node_labels)\n",
    "            else:\n",
    "                print(\"input grouped info need to be dictionary type\")\n",
    "        else:\n",
    "            print(\"input grouped info cannot be empty\")\n",
    "    \n",
    "    def import_relationships(self, input_relationships):\n",
    "        if input_relationships:\n",
    "            self.relationships = input_relationships\n",
    "        else:\n",
    "            print(\"relationships cannot be empty\")\n",
    "\n",
    "\n",
    "    def create_unique_alias(self, label):\n",
    "        \"\"\"Creates a unique alias for a node to prevent label overlap in queries.\"\"\"\n",
    "        base_alias = label.lower()\n",
    "        alias = base_alias\n",
    "        counter = 1\n",
    "        while alias in self.usable_labels:\n",
    "            alias = f\"{base_alias}{counter}\"\n",
    "            counter += 1\n",
    "        return alias\n",
    "    \n",
    "    def add_node(self):\n",
    "        \"\"\"Adds a node with random properties selected from grouped_info.\"\"\"\n",
    "        node_label = ''\n",
    "        if self.node_labels:\n",
    "            node_label = random.choice(self.node_labels) \n",
    "            # self.selected_node_label.append(node_label)\n",
    "            # print(self.selected_node_label, node_label, type(self.selected_node_label))\n",
    "\n",
    "            possible_props = self.grouped_info[node_label]\n",
    "            property_label, properties_list = random.choice(list(possible_props.items()))\n",
    "\n",
    "            alias = self.create_unique_alias(node_label)\n",
    "            # self.selected_alias.append(alias)\n",
    "\n",
    "            self.selected_label_alias[alias]=node_label\n",
    "\n",
    "            property_value = random.choice(properties_list)\n",
    "            properties_str = f\"{property_label}: '{property_value}'\" if possible_props else ''\n",
    "            node_value = f\"{node_label} {{{properties_str}}}\"\n",
    "            node = Node(f\"({alias}:{node_value})\")\n",
    "            self.nodes.append(node)\n",
    "            self.usable_labels.add(alias)  # Store label for possible RETURN clause usage\n",
    "            return node \n",
    "        print(\"No node labels available. Please import grouped info first.\")\n",
    "        return None\n",
    "\n",
    "        \n",
    "    @depth_manager.depth_control\n",
    "    def add_hop(self,hop_p=0.5):\n",
    "        \"\"\"\n",
    "        Randomly generate hops as condition to relationship based on a customizable possibility;\n",
    "        the default possibility is 0.5\n",
    "        \"\"\"\n",
    "        current_depth = depth_manager.depth\n",
    "        hop = random.randint(1,10) #TODO: see if this is reasonable\n",
    "        upper_hop = hop + random.randint(1,10)\n",
    "        exact_hop = f\"*{hop}\"\n",
    "        ceiling_hop = f\"*..{upper_hop}\"\n",
    "        floor_hop = f\"*{hop}..\"\n",
    "        interval_hop = f\"*{hop}..{upper_hop}\"\n",
    "        hop_choices = [exact_hop, ceiling_hop, floor_hop, interval_hop]\n",
    "        if random.random() > hop_p and current_depth < depth_manager._max_depth:\n",
    "            hop_choice = random.choice(hop_choices)\n",
    "            return hop_choice\n",
    "        else:\n",
    "            return None\n",
    "\n",
    "\n",
    "    @depth_manager.depth_control\n",
    "    def add_relationship(self, hop_p=0.5):\n",
    "        \"\"\" Randomly generate a relationship between two nodes \"\"\"\n",
    "        current_depth = depth_manager.depth\n",
    "        rel_type = random.choice(self.relationships)\n",
    "        if current_depth>=3 and random.random() > 0.5: \n",
    "            direction1 = \"<-\"\n",
    "            direction2 = \"-\"\n",
    "        else:\n",
    "            direction1 = \"-\" \n",
    "            direction2 = \"->\"\n",
    "        hop_result = self.add_hop(hop_p) if self.add_hop(hop_p) else ''\n",
    "        relationship = Node(f\"{direction1} [:{rel_type}{hop_result}] {direction2}\")\n",
    "        return Node(\"-\", [relationship])\n",
    "    \n",
    "\n",
    "    @depth_manager.depth_control\n",
    "    def add_condition(self, where_p=0.5):\n",
    "        \"\"\"\n",
    "        Randomly generate WHERE clause based on a customizable possibility;\n",
    "        the default possibility where_p is 0.5\n",
    "        \"\"\"\n",
    "        current_depth = depth_manager.depth\n",
    "        if random.random() > where_p and current_depth < depth_manager._max_depth:\n",
    "            # node_label = random.choice(labels)\n",
    "            # label_lower = node_label.lower()\n",
    "            # property_label = random.choice(property_labels)\n",
    "            # node_label = random.choice(self.selected_node_label)\n",
    "            # alias = random.choice\n",
    "            alias, node_label = random.choice(list(self.selected_label_alias.items()))\n",
    "            print(alias, node_label)\n",
    "\n",
    "            possible_properties = self.grouped_info[node_label]\n",
    "            if possible_properties:\n",
    "                property_label, properties_list = random.choice(list(possible_properties.items()))\n",
    "                sample_prop_type = properties_list[0]\n",
    "                value = random.randint(20, 50) if isinstance(sample_prop_type, int) else random.choice(properties_list) \n",
    "            #TODO: customize the int part\n",
    "\n",
    "                operator = random.choice([\">\", \"<\", \"=\", \"<=\", \">=\"]) if isinstance(sample_prop_type, int) else '='\n",
    "                return Clause(\"WHERE\", [Clause(f\"{alias}.{property_label} {operator} '{value}'\", [])])\n",
    "            return None\n",
    "        return None\n",
    "\n",
    "    def add_return(self, return_num=None):\n",
    "        if return_num:\n",
    "            random_k = random.randint(1,return_num)\n",
    "            # choices = random.sample(self.usable_labels, return_num)\n",
    "        usable_labels = self.get_usable_labels()\n",
    "        random_k = random.randint(1,len(usable_labels))\n",
    "        choices = random.sample(self.usable_labels, random_k)\n",
    "        if choices:  # Check if the list is not empty\n",
    "            return Clause(\"RETURN\", choices)\n",
    "        return None\n",
    "\n",
    "    # Helper functions\n",
    "    def get_usable_labels(self):\n",
    "        return list(self.usable_labels)\n",
    "    \n",
    "    def get_parts(self):\n",
    "        \"\"\" Returns a list of all nodes in a readable string format. \"\"\"\n",
    "        return [part for part in self.parts]\n",
    "    # def get_readable_nodes(self)\n",
    "    \n",
    "    def reset_per_gen(self):\n",
    "        \"\"\"\n",
    "        Only reset paras involved in each generation but doesn't reset the nested dict\n",
    "        \"\"\"\n",
    "        self.nodes = []\n",
    "        self.usable_labels = set()\n",
    "        self.selected_label_alias = {}\n",
    "        self.parts = []\n",
    "\n",
    "    def reset_all(self):\n",
    "        self.nodes = []\n",
    "        self.node_labels = []\n",
    "        self.grouped_info = {} \n",
    "        self.usable_labels = set()\n",
    "        self.selected_label_alias = {}\n",
    "        self.parts = []\n",
    "    \n",
    "        \n",
    "    def is_relationship(self, part):\n",
    "        \"\"\"\n",
    "        Determine if the given part of a query is a relationship based on containing \"[]\"\n",
    "        Ensures that part is a string before checking.\n",
    "        \"\"\"\n",
    "        # pattern = re.compile(r'\\[(.*?)\\]')\n",
    "        pattern = re.compile(r'(?:-\\s*\\[:.*?\\]\\s*->|<-\\s*\\[:.*?\\]\\s*-)')\n",
    "        trying = r\"-\\s*\\[:?([A-Za-z0-9_]+)?(\\*\\d*(\\.\\.\\d*)?)?\\]\\s*[-<>]?\"\n",
    "        # Ensure part is a string or bytes-like object\n",
    "        if isinstance(part, str):\n",
    "            # if pattern.search(part):\n",
    "            if re.search(trying, part):\n",
    "                return True\n",
    "        return False\n",
    "\n",
    "    \n",
    "    # Integrated function\n",
    "    def generate_query(self, flag=True, return_num=None, part_num=None, hop_p=0.5, where_p=0.5):\n",
    "        \"\"\"\n",
    "        Generate cypher query with random parts; \n",
    "        part_num is by default randomly set, but can also be customized. \n",
    "        \"\"\"\n",
    "        def alternate_functions(flag):\n",
    "            if flag:\n",
    "                return self.add_node(), not flag\n",
    "            else:\n",
    "                return self.add_relationship(hop_p), not flag\n",
    "            \n",
    "        #reset paras before a new generation\n",
    "        self.reset_per_gen()\n",
    "        depth_manager.reset_depth()\n",
    "\n",
    "        #flag = True  # Ensure that we start with producing nodes\n",
    "        #return_num = 1 #default returns ONE random label\n",
    "        if part_num is None:\n",
    "            part_num = random.randint(1, depth_manager._max_depth-2)\n",
    "\n",
    "        # Keep adding nodes and relationships while depth is within limit\n",
    "        for _ in range(part_num+1):\n",
    "            part, flag = alternate_functions(flag)\n",
    "            if part is None:\n",
    "                break\n",
    "            self.parts.append(part)\n",
    "        # Check if the last part is a relationship; if so, add a terminating node\n",
    "        if self.parts and self.is_relationship(str(self.parts[-1])): #ensure the input part is in string format\n",
    "            final_node = self.add_node()  # Generate a final node if previously ended with relationship\n",
    "            if final_node:\n",
    "                self.parts.append(final_node)\n",
    "                print(\"final_node added:\", final_node)\n",
    "\n",
    "        # Optionally add a WHERE clause if depth is still under max_depth\n",
    "        condition = self.add_condition(where_p)\n",
    "        if condition:\n",
    "            self.parts.append(condition)\n",
    "\n",
    "        # Add RETURN clause \n",
    "        ret = self.add_return(return_num)\n",
    "        if ret:\n",
    "            self.parts.append(ret)\n",
    "\n",
    "        # Create the MATCH node only if there are parts to include\n",
    "        print(\"part_num is: \", part_num)\n",
    "        return Clause(\"MATCH\", self.parts) if self.parts else None\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Test Query Generation using Alzkb selected dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loaded node_labels: ['BiologicalProcess', 'BodyPart', 'CellularComponent', 'Disease', 'Drug', 'DrugClass', 'Gene', 'MolecularFunction', 'Pathway', 'Symptom']\n",
      "final_node added: (cellularcomponent:CellularComponent {commonName: 'ruffle'})\n",
      "Max depth reached\n",
      "part_num is:  3\n",
      "MATCH (drug:Drug {commonName: '4-(5-BENZENESULFONYLAMINO-1-METHYL-1H-BENZOIMIDAZOL-2-YLMETHYL)-BENZAMIDINE'}) - [:GENEINPATHWAY*4..] -> (bodypart:BodyPart {commonName: 'carpal region'}) <- [:GENEPARTICIPATESINBIOLOGICALPROCESS] - (cellularcomponent:CellularComponent {commonName: 'ruffle'}) RETURN bodypart\n",
      "loaded node_labels: ['BiologicalProcess', 'BodyPart', 'CellularComponent', 'Disease', 'Drug', 'DrugClass', 'Gene', 'MolecularFunction', 'Pathway', 'Symptom']\n",
      "final_node added: (biologicalprocess:BiologicalProcess {commonName: 'regulation of Ras protein signal transduction'})\n",
      "molecularfunction MolecularFunction\n",
      "part_num is:  1\n",
      "MATCH (molecularfunction:MolecularFunction {commonName: 'basic amino acid transmembrane transporter activity'}) - [:GENEASSOCIATESWITHDISEASE] -> (biologicalprocess:BiologicalProcess {commonName: 'regulation of Ras protein signal transduction'}) WHERE molecularfunction.commonName = 'sphingomyelin phosphodiesterase activity' RETURN biologicalprocess, molecularfunction\n",
      "loaded node_labels: ['BiologicalProcess', 'BodyPart', 'CellularComponent', 'Disease', 'Drug', 'DrugClass', 'Gene', 'MolecularFunction', 'Pathway', 'Symptom']\n",
      "final_node added: (bodypart:BodyPart {commonName: 'round window of inner ear'})\n",
      "bodypart BodyPart\n",
      "part_num is:  1\n",
      "MATCH (symptom:Symptom {commonName: 'Back Pain'}) - [:GENEPARTICIPATESINBIOLOGICALPROCESSNone] -> (bodypart:BodyPart {commonName: 'round window of inner ear'}) WHERE bodypart.commonName = 'oval window' RETURN bodypart, symptom\n",
      "loaded node_labels: ['BiologicalProcess', 'BodyPart', 'CellularComponent', 'Disease', 'Drug', 'DrugClass', 'Gene', 'MolecularFunction', 'Pathway', 'Symptom']\n",
      "final_node added: (pathway:Pathway {commonName: 'Toxicity of tetanus toxin (TeNT)'})\n",
      "part_num is:  1\n",
      "MATCH (symptom:Symptom {commonName: 'Alien Hand Syndrome'}) - [:DISEASEASSOCIATESWITHDISEASE*..11] -> (pathway:Pathway {commonName: 'Toxicity of tetanus toxin (TeNT)'}) RETURN pathway, symptom\n",
      "loaded node_labels: ['BiologicalProcess', 'BodyPart', 'CellularComponent', 'Disease', 'Drug', 'DrugClass', 'Gene', 'MolecularFunction', 'Pathway', 'Symptom']\n",
      "final_node added: (symptom:Symptom {commonName: 'Skin Manifestations'})\n",
      "part_num is:  1\n",
      "MATCH (gene:Gene {geneSymbol: 'LOC129389217'}) - [:GENEINTERACTSWITHGENE*5] -> (symptom:Symptom {commonName: 'Skin Manifestations'}) RETURN gene, symptom\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/hx/mhvsgnnd2s3_cc4f_0smyv800000gn/T/ipykernel_44953/2308015174.py:147: DeprecationWarning: Sampling from a set deprecated\n",
      "since Python 3.9 and will be removed in a subsequent version.\n",
      "  choices = random.sample(self.usable_labels, random_k)\n"
     ]
    }
   ],
   "source": [
    "# Test if alzkb one works\n",
    "qm = QueryManager()\n",
    "for _ in range(5):\n",
    "    qm.import_grouped_info(alzkb_nested_dict)\n",
    "    qm.import_relationships(relationships)\n",
    "    depth_manager.set_max_depth(5)\n",
    "    depth_manager.reset_depth()\n",
    "    print(qm.generate_query())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create Crossover/Mutation function and Fitness/Evaluation function for GP"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loaded node_labels: ['BiologicalProcess', 'BodyPart', 'CellularComponent', 'Disease', 'Drug', 'DrugClass', 'Gene', 'MolecularFunction', 'Pathway', 'Symptom']\n",
      "final_node added: (drug:Drug {commonName: 'Iodixanol'})\n",
      "part_num is:  1\n",
      "(cellularcomponent:CellularComponent {commonName: 'axon'}) <class '__main__.Node'>\n",
      "- [:DISEASEASSOCIATESWITHDISEASENone] -> <class '__main__.Node'>\n",
      "(drug:Drug {commonName: 'Iodixanol'}) <class '__main__.Node'>\n",
      "RETURN cellularcomponent, drug <class '__main__.Clause'>\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/hx/mhvsgnnd2s3_cc4f_0smyv800000gn/T/ipykernel_44953/818492090.py:150: DeprecationWarning: Sampling from a set deprecated\n",
      "since Python 3.9 and will be removed in a subsequent version.\n",
      "  choices = random.sample(self.usable_labels, random_k)\n"
     ]
    }
   ],
   "source": [
    "# Test \n",
    "def crossover(query1, query2):\n",
    "    if len(query1.nodes) > 1 and len(query2.nodes) > 1:\n",
    "        # Simple crossover by swapping half of the nodes\n",
    "        mid_point = min(len(query1.nodes), len(query2.nodes)) // 2\n",
    "        new_nodes1 = query1.nodes[:mid_point] + query2.nodes[mid_point:]\n",
    "        new_nodes2 = query2.nodes[:mid_point] + query1.nodes[mid_point:]\n",
    "        query1.nodes = new_nodes1\n",
    "        query2.nodes = new_nodes2\n",
    "\n",
    "qm = QueryManager()\n",
    "\n",
    "qm.import_grouped_info(alzkb_nested_dict)\n",
    "qm.import_relationships(relationships)\n",
    "depth_manager.set_max_depth(5)\n",
    "depth_manager.reset_depth()\n",
    "query = qm.generate_query()\n",
    "query_parts = qm.get_parts()\n",
    "\n",
    "\n",
    "for part in query_parts:\n",
    "    print(part, type(part))\n",
    "# for part in query_parts:\n",
    "#     print(part)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
